var fs = require("fs");
var chalk = require("chalk");
var form_data = require("form-data");
var querystring = require("querystring");
var http = require("http");

var stations={
"40700":"پارس آباد مغان",
"40701":"ماکو",
"40702":"جلفا",
"40703":"خوی",
"40704":"اهر",
"40705":"مشکین شهر",
"40706":"تبریز",
"40707":"سهند",
"40708":"اردبیل",
"40709":"آستارا",
"40710":"سراب",
"40711":"کلیبر",
"40712":"ارومیه",
"40713":"مراغه",
"40714":"گرمی",
"40715":"ماه نشان",
"40716":"میانه",
"40717":"خلخال",
"40718":"بندر انزلی",
"40719":"رشت",
"40720":"منجیل",
"40721":"مراوه تپه",
"40722":"سلماس",
"40723":"بجنورد",
"40724":"پیرانشهر",
"40725":"سردشت",
"40726":"مهاباد",
"40727":"سقز",
"40728":"تکاب",
"40729":"زنجان",
"40730":"خرم دره",
"40731":"قزوین",
"40732":"رامسر",
"40733":"خدابنده",
"40734":"نوشهر",
"40735":"سیاه بیشه",
"40736":"بابلسر",
"40737":"قراخیل قائمشهر",
"40738":"گرگان",
"40739":"شاهرود",
"40740":"قوچان",
"40741":"سرخس",
"40742":"بیارجمند",
"40743":"سبزوار",
"40744":"گلمکان چناران",
"40745":"مشهد",
"40746":"نیشابور",
"40747":"سنندج",
"40748":"بیجار",
"40749":"زرینه اباتو",
"40750":"مریوان",
"40751":"شمیران",
"40752":"کرج",
"40753":"دوشان تپه",
"40754":"تهران",
"40755":"آبعلی",
"40756":"فیروزکوه",
"40757":"سمنان",
"40758":"گرمسار",
"40759":"ساری",
"40760":"کیاسر",
"40761":"دامغان",
"40762":"تربت حیدریه",
"40763":"کاشمر",
"40764":"روانسر",
"40765":"سرپل ذهاب",
"40766":"کرمانشاه",
"40767":"همدان-نوژه",
"40768":"همدان",
"40769":"اراک",
"40770":"قم",
"40771":"کنگاور",
"40772":"قروه",
"40773":"نورآباد لرستان",
"40774":"بروجرد",
"40775":"ملایر",
"40776":"الشتر",
"40777":"فرودگاه امام",
"40778":"گناباد",
"40779":"اسلام  آباد غرب",
"40780":"ایلام",
"40781":"مهران",
"40782":"خرم آباد",
"40783":"الیگودرز",
"40785":"کاشان",
"40786":"پل دختر",
"40787":"داران",
"40789":"خور بیابانک",
"40790":"رباط پشت بادام",
"40791":"طبس",
"40792":"فردوس",
"40793":"قائن",
"40794":"صفی دزفول",
"40795":"دزفول",
"40796":"دهلران",
"40797":"کوهرنگ",
"40798":"شهر کرد",
"40799":"اردستان",
"40800":"اصفهان",
"40801":"نایین",
"40802":"شرق اصفهان",
"40803":"کبوترآباد",
"40804":"عقدا",
"40805":"جیرانده",
"40806":"تربت جام",
"40807":"درگز",
"40809":"بیرجند",
"40810":"بستان",
"40811":"اهواز",
"40812":"مسجد سلیمان",
"40813":"رامهرمز",
"40814":"لردگان",
"40815":"شهرضا",
"40816":"گاریز",
"40818":"آباده",
"40820":"بافق",
"40821":"یزد",
"40825":"فریمان",
"40827":"نهبندان",
"40828":"اقلید فارس",
"40829":"زابل",
"40830":"امیدیه-پایگاه",
"40831":"آبادان",
"40832":"بندر ماهشهر",
"40833":"امیدیه-آغاجاری",
"40834":"بهبهان",
"40835":"دوگنبدان",
"40836":"یاسوج",
"40837":"خواف",
"40838":"دهدشت",
"40839":"انار",
"40840":"مروست",
"40841":"کرمان",
"40842":"دره شهر",
"40843":"شهداد",
"40844":"سد درودزن",
"40845":"جزیره خارک",
"40846":"بندر دیلم",
"40847":"زرقان",
"40848":"شیراز",
"40849":"شهر بابک",
"40851":"سیرجان",
"40852":"لاله زار",
"40853":"بافت",
"40854":"بم",
"40855":"صفاشهر",
"40856":"زاهدان",
"40857":"بوشهر",
"40858":"بوشهر-ساحلی",
"40859":"فسا",
"40861":"کازرون",
"40862":"حسن آباد داراب",
"40863":"حاجی آباد",
"40864":"فراشبند",
"40869":"نیریز فارس",
"40870":"خاش",
"40872":"بندر دیر",
"40873":"لار",
"40874":"زابلی",
"40875":"بندر عباس",
"40876":"میناب",
"40877":"کهنوج",
"40878":"سراوان",
"40879":"ایرانشهر",
"40880":"جزیره قشم",
"40881":"جزیره لاوان",
"40882":"جزیره کیش",
"40883":"بندر لنگه",
"40885":"دلگان",
"40886":"تویسرکان",
"40887":"سلفچگان",
"40889":"جزیره سیری",
"40890":"جزیره ابوموسی",
"40891":"محلات",
"40893":"جاسک",
"40895":"نیکشهر",
"40897":"کنارک چابهار",
"40898":"چابهار",
"77436":"دستجرد",
"77770":"شکوهیه",
"88101":"پارس آباد",
"88104":"فرودگاه خوی",
"88107":"فرودگاه اردبیل ",
"88113":"کلاله",
"88116":"دشت ساری-فرودگاه",
"88118":"فرودگاه زنجان",
"88120":"شاهرود",
"88122":"سبزوار-فرودگاه",
"88125":"پیام",
"88132":"اراک",
"88150":"طبس-فرودگاه",
"88179":"بم",
"88187":"جم توحید",
"88188":"عسلویه-فرودگاه",
"88190":"لامرد",
"99202":"بیله سوار",
"99203":"پلدشت",
"99209":"چالدران",
"99214":"قره ضیاالدین",
"99220":"مرند",
"99226":"ورزقان",
"99227":"شبستر",
"99228":"هریس",
"99231":"سرعین",
"99232":"نمین",
"99233":"نیر",
"99234":"شرق تبریز",
"99236":"عجب شیر",
"99237":"مینودشت",
"99239":"بناب",
"99240":"گنبد کاووس ",
"99241":"گرگان-هاشم آباد",
"99242":"بندر ترکمن",
"99246":"کهریز",
"99248":"بستان آباد",
"99249":"تالش",
"99262":"مانه سملقان",
"99263":"فیروز آباد-کوثر",
"99268":"کیاشهر",
"99271":"اینچه برون",
"99272":"رشت-کشاورزی",
"99276":"لاهیجان",
"99277":"رضوان",
"99278":"نقده",
"99280":"بانه",
"99281":"ماسوله",
"99282":"رودسر",
"99283":"چاراویماق",
"99284":"ملکان",
"99287":"اسفراین",
"99288":"اشنویه",
"99292":"میاندوآب",
"99295":"جاجرم",
"99298":"آببر",
"99299":"گلوگاه",
"99300":"علی آباد",
"99301":"رازمیان",
"99302":"دیلمان",
"99303":"معلم کلایه",
"99304":"بندر گز",
"99306":"بندر امیرآباد",
"99309":"آمل",
"99310":"آوج",
"99314":"شاهین دژ",
"99317":"رودبار",
"99319":"سیردان",
"99320":"چیتگر",
"99321":"طالقان",
"99324":"جغتای",
"99327":"بویین زهرا",
"99331":"ژئوفیزیک تهران",
"99332":"بوکان",
"99334":"خیرآباد",
"99335":"گرماب",
"99336":"میامی",
"99348":"کجور",
"99354":"طرق",
"99356":"بردسکن",
"99357":"بلده",
"99360":"پل سفید",
"99361":"الاشت",
"99365":"کوهین",
"99366":"لواسان",
"99367":"تاکستان",
"99368":"آبیک",
"99369":"دماوند",
"99370":"فیروزکوه-آلودگی",
"99372":"ساوه",
"99373":"کرج-کشاورزی",
"99375":"شهریار",
"99382":"هزارکانیان",
"99384":"نهاوند",
"99385":"رزن",
"99386":"شهمیرزاد",
"99387":"فامنین",
"99388":"قهاوند",
"99396":"هشتگرد",
"99401":"سرایان",
"99402":"حاجی آباد",
"99405":"ایوانکی",
"99406":"ورامین",
"99407":"بشرویه",
"99409":"تفرش",
"99410":"آشتیان",
"99412":"غرق آباد",
"99414":"کوشک نصرت",
"99417":"گلپایگان",
"99420":"اکباتان",
"99421":"نطنز",
"99422":"اسداباد",
"99425":"کامیاران",
"99426":"کوه سفید",
"99427":"جوانرود",
"99428":"تازه آباد-ثَلاثِ باباجانی",
"99429":"سنقر",
"99430":"سومار",
"99431":"هرسین",
"99432":"کمیجان",
"99433":"ایوان غرب",
"99435":"قصر شیرین",
"99437":"خور بیرجند",
"99438":"کوهدشت",
"99439":"خنداب",
"99440":"کهک",
"99441":"شازند",
"99443":"خمین",
"99444":"درود",
"99445":"ازنا",
"99446":"شوشتر",
"99447":"میمه",
"99449":"مورچه خورت",
"99452":"چادگان",
"99454":"گیلان غرب",
"99455":"ایذه",
"99456":"شادگان",
"99459":"بروجن",
"99461":"دلیجان",
"99463":"لومار",
"99466":"سرابله",
"99468":"سیلاخور",
"99471":"ریمله",
"99473":"چوپانان",
"99474":"رومشکان",
"99482":"خوانسار",
"99484":"دهق",
"99485":"ایمان آباد",
"99488":"آبدانان",
"99489":"فریدون شهر",
"99493":"حسینیه",
"99497":"نجف آباد",
"99499":"سربیشه",
"99501":"سپید دشت",
"99502":"شول آباد",
"99504":"سامان",
"99505":"ورزنه",
"99506":"مبارکه",
"99507":"زرین شهر",
"99508":"لالی",
"99509":"فرخ شهر",
"99511":"میبد",
"99512":"فارسان",
"99513":"گتوند",
"99514":"شوش",
"99515":"سمیرم",
"99516":"ایزدخواست",
"99518":"اردل",
"99522":"بهاباد",
"99523":"بلداجی",
"99527":"دهدز",
"99528":"مهریز",
"99532":"کوهبنان",
"99535":"اهواز-کشاورزی",
"99536":"دهسلام",
"99537":"هندیجان",
"99538":"آغاجاری",
"99539":"ابرکوه",
"99549":"زرند",
"99550":"جیرفت",
"99552":"لیکک",
"99555":"سی سخت",
"99561":"بوانات ",
"99562":"رفسنجان",
"99565":"امام زاده جعفر",
"99566":"سپیدان",
"99574":"هرات ",
"99575":"تخت جمشید",
"99579":"ارسنجان",
"99580":"نورآباد ممسنی",
"99583":"گلبافت",
"99586":"نصرت اباد",
"99590":"زرین دشت",
"99600":"برازجان",
"99607":"استهبان",
"99608":"میرجاوه",
"99621":"سرارود کرمانشاه",
"99623":"زهک",
"99630":"فیروز آباد",
"99634":" قیر و کارزین ",
"99646":"جهرم",
"99649":"بزمان",
"99650":"راسک",
"99656":"رودان",
"99665":"پارسیان",
"99666":"بستک",
"99674":"بندر خمیر",
"99675":"قشم-ساحلی",
"99680":"سردشت بشاگرد",
"99686":"بندر سیریک",
"99688":"لنگه-ساحلی"
};

var relats={
"38":["88125","99321","40752","99373","99396","88125","99321","40752","99373","99396"],
"39":["40708","99202","88101","40700","40717","99231","88107","99263","40714","40705","99232","99233","40708","99202","88101","40700","40717","99231","88107","99263","40714","40705","99232","99233"],
"40":["40712","99288","99332","99203","40724","40728","99209","40703","40725","40722","99314","88104","99214","99246","40701","40726","99292","99278","40712","99288","99332","99203","40724","40728","99209","40703","40725","40722","99314","88104","99214","99246","40701","40726","99292","99278"],
"41":["40704","99248","99239","40706","40702","99283","40710","40707","99227","99234","99236","40711","40713","99220","99284","40716","99226","99228","40704","99248","99239","40706","40702","99283","40710","40707","99227","99234","99236","40711","40713","99220","99284","40716","99226","99228"],
"42":["99600","40872","40846","40857","40858","40845","88187","88188","99600","40872","40846","40857","40858","40845","88187","88188"],
"43":["99518","99459","99523","99504","40798","99512","99509","40797","40814","99518","99459","99523","99504","40798","99512","99509","40797","40814"],
"44":["40799","40800","99452","99473","99482","40789","40787","99484","99507","99515","40802","40815","99489","40785","40803","99417","99506","99449","99447","40801","99497","99421","99505","40799","40800","99452","99473","99482","40789","40787","99484","99507","99515","40802","40815","99489","40785","40803","99417","99506","99449","99447","40801","99497","99421","99505"],
"45":["99634","40818","99579","99607","40828","99516","99561","99575","99646","40862","40847","99590","99566","40844","40848","40855","40864","40859","99630","40861","40873","88190","99580","40869","99634","40818","99579","99607","40828","99516","99561","99575","99646","40862","40847","99590","99566","40844","40848","40855","40864","40859","99630","40861","40873","88190","99580","40869"],
"46":["40709","40718","99249","40805","99302","40719","99272","99317","99282","99268","99276","99281","40720","40709","40718","99249","40805","99302","40719","99272","99317","99282","99268","99276","99281","40720"],
"47":["99271","99242","99304","99300","88113","40738","99241","99240","40721","99237","99271","99242","99304","99300","88113","40738","99241","99240","40721","99237"],
"48":["99422","99420","40886","99385","99387","99388","40775","99384","40768","40767","99422","99420","40886","99385","99387","99388","40775","99384","40768","40767"],
"49":["99666","99674","99686","40875","40883","99665","40893","40890","40889","40880","40882","40881","40863","99656","99680","99675","99688","40876","99666","99674","99686","40875","40883","99665","40893","40890","40889","40880","40882","40881","40863","99656","99680","99675","99688","40876"],
"50":["99488","40780","99433","40842","40796","99466","99463","40781","99488","40780","99433","40842","40796","99466","99463","40781"],
"51":["40839","40853","40854","88179","99550","99562","99549","40851","40843","40849","40841","40877","99532","99583","40852","40839","40853","40854","88179","99550","99562","99549","40851","40843","40849","40841","40877","99532","99583","40852"],
"52":["40779","99428","99427","40764","99621","40765","99429","99430","99435","40766","40771","99454","99431","40779","99428","99427","40764","99621","40765","99429","99430","99435","40766","40771","99454","99431"],
"53":["99565","40835","40838","99555","99552","40836","99565","40835","40838","99555","99552","40836"],
"54":["99356","40806","40762","99324","40837","40807","40743","88122","40741","99354","40825","40740","40763","40744","40778","40745","40746","99356","40806","40762","99324","40837","40807","40743","88122","40741","99354","40825","40740","40763","40744","40778","40745","40746"],
"55":["40831","99538","40833","40830","40811","99535","99455","40810","40832","40834","99493","40795","99527","40813","99456","99514","99446","40794","99513","99508","99508","40812","99537","40831","99538","40833","40830","40811","99535","99455","40810","40832","40834","99493","40795","99527","40813","99456","99514","99446","40794","99513","99508","99508","40812","99537"],
"56":["99280","40748","40749","40727","40747","40772","99425","40750","99382","99280","40748","40749","40727","40747","40772","99425","40750","99382"],
"57":["99445","40776","40783","99485","40774","40786","40782","99444","99474","99471","99501","99468","99502","99438","40773","99445","40776","40783","99485","40774","40786","40782","99444","99474","99471","99501","99468","99502","99438","40773"],
"58":["99410","40769","88132","99409","99443","99439","99461","99372","99441","99412","99432","40891","99410","40769","88132","99409","99443","99439","99461","99372","99441","99412","99432","40891"],
"59":["99309","99361","40736","99357","99306","99360","88116","40732","40759","40735","40737","99348","40760","99299","40734","99309","99361","40736","99357","99306","99360","88116","40732","40759","40735","40737","99348","40760","99299","40734"],
"60":["99287","40723","99295","99262","99287","40723","99295","99262"],
"61":["99368","99310","99327","99367","99301","99319","40731","99365","99303","99368","99310","99327","99367","99301","99319","40731","99365","99303"],
"62":["77436","40887","77770","40770","99414","99426","99440","77436","40887","77770","40770","99414","99426","99440"],
"63":["99405","40742","40761","99277","40757","40739","88120","99386","40758","99336","99405","40742","40761","99277","40757","40739","88120","99386","40758","99336"],
"64":["40879","99649","40898","40870","40885","99650","40829","40874","40856","99623","40878","40897","99608","99586","40895","40879","99649","40898","40870","40885","99650","40829","40874","40856","99623","40878","40897","99608","99586","40895"],
"65":["99407","40809","99402","99437","99536","99401","99499","40791","88150","40792","40793","40827","99407","40809","99402","99437","99536","99401","99499","40791","88150","40792","40793","40827"],
"66":["40755","40754","99320","99369","40753","99331","40751","99375","40777","40756","99370","99366","99406","40755","40754","99320","99369","40753","99331","40751","99375","40777","40756","99370","99366","99406"],
"67":["99539","40820","99522","40790","40804","40816","40840","99528","99511","99574","40821","99539","40820","99522","40790","40804","40816","40840","99528","99511","99574","40821"],
"68":["99298","40733","40730","99334","40729","88118","99335","40715","99298","40733","40730","99334","40729","88118","99335","40715"]
// "68":["99298"]

};
var provs={
"38":"البرز",
// "39":"اردبیل",
// "40":"آذربایجان غربی",
// "41":"اذربایجان شرقی",
// "42":"بوشهر",
// "43":"چهارمحال و بختیاری",
// "44":"اصفهان",
// "45":"فارس",
// "46":"گیلان",
// "47":"گلستان",
// "48":"همدان",
// "49":"هرمزگان",
// "50":"ایلام",
// "51":"کرمان",
// "52":"کرمانشاه",
// "53":"کهکیلویه و بویراحمد",
// "54":"خراسان رضوی",
// "55":"خوزستان",
// "56":"کردستان",
// "57":"لرستان",
// "58":"مرکزی",
// "59":"مازندران",
// "60":"خراسان شمالی",
// "61":"قزوین",
// "62":"قم",
// "63":"سمنان",
// "64":"سیستان و بلوچستان",
// "65":"خراسان جنوبی",
// "66":"تهران",
// "67":"یزد",
// "68":"زنجان"
};
var statTypes={
              //  "1":"میانگین دمای ماهانه",
              //  "2":"مجموع بارش ماهانه",
              //  "3":"میانگین سرعت باد ماهانه",
              //  "4":"بیشینه دمای ماهانه",
              //  "5":"کمینه دمای ماهانه",
               "6":"سمت و سرعت بیشینه ماهانه"
             };
var temp=1;
if (!fs.existsSync("reports"))
    fs.mkdirSync("reports");
// for(prov in provs)
// {
//   if (!fs.existsSync("reports/"+provs[prov]))
//       fs.mkdirSync("reports/"+provs[prov]);
//   var relatedStations=relats[prov];
//   for(currentStation in relatedStations)
//   {
//     if (!fs.existsSync("reports/"+provs[prov]+"/"+stations[relatedStations[currentStation]]))
//         fs.mkdirSync("reports/"+provs[prov]+"/"+stations[relatedStations[currentStation]]);
//     for(statType in statTypes){
//       getData(prov,relatedStations[currentStation],statType,"reports/"+provs[prov]+"/"+stations[relatedStations[currentStation]]);
//       // sleep(2000);
//       break;
//   }
//   break;
//   }
//   break;
// }
for(statType in statTypes){
  if (!fs.existsSync("reports/"+statTypes[statType]))
      fs.mkdirSync("reports/"+statTypes[statType]);
      for(prov in provs)
      {
        if (!fs.existsSync("reports/"+statTypes[statType]+"/"+provs[prov]))
            fs.mkdirSync("reports/"+statTypes[statType]+"/"+provs[prov]);
        var relatedStations=relats[prov];
        for(currentStation in relatedStations)
        {
          // if (!fs.existsSync("reports/"+statTypes[statType]+"/"+provs[prov]+"/"+stations[relatedStations[currentStation]]))
          //     fs.mkdirSync("reports/"+statTypes[statType]+"/"+provs[prov]+"/"+stations[relatedStations[currentStation]]);
            getData(prov,relatedStations[currentStation],statType,"reports/"+statTypes[statType]+"/"+provs[prov]);
            sleep(1000);
        }
        }
        // break;
      }
// saveData("","","");
/////////////////////////////////////////////////////////////////////////////////////
function saveData(data,dataName,dataUri){

if(!fs.existsSync(dataUri+"/"+dataName)){
fs.writeFile(dataUri+"/"+dataName,data,function(err){
  if(err)
  {
  console.log(chalk.red("Can't save "+dataUri+"/"+dataName+".txt"));
}
});
}
else{
  fs.writeFile(dataUri+"/"+dataName,"\ufeff"+data,"utf8",function(error){
    if(error)
    console.log(chalk.red("bad"));
  });
}
}
/////////////////////////////////////////////////////////////////////////////////////
function getData(prov,relatedStation,statType,uri)
{


  // Build the post string from an object
  var post_data = querystring.stringify({
  "repProviance":prov,
  "repStation":relatedStation,
  "parameters":statType,
  "start_year":"1951",
  "end_year":"2014",
  "SearchBtn":"جستجو",
  });
  // console.log(post_data);

  // An object of options to indicate where to post to
  var post_options = {
      host: 'www.irimo.ir',
      port: '80',
      path: '/far/wd/2703-%D8%AF%D8%B3%D8%AA%D8%B1%D8%B3%DB%8C-%D8%AF%D8%A7%D8%AF%D9%87-%D9%87%D8%A7%DB%8C-%D8%A7%D9%82%D9%84%DB%8C%D9%85%DB%8C-%D8%AA%D8%A7%D8%B1%DB%8C%D8%AE%DA%86%D9%87.html',
      method: 'POST',
      headers: {
          "Host": "irimo.ir",
          "Connection": "keep-alive",
          "Content-Length": Buffer.byteLength(post_data),
          "Cache-Control": "no-cache",
          // "Origin": "chrome-extension://fdmmgilgnpjigdojojpjoooidkmcomcm",
          // "User-Agent": "Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/54.0.2840.100 Safari/537.36",
          "Content-Type": "application/x-www-form-urlencoded",
          "Accept": "*/*",
          // "Accept-Encoding": "gzip, deflate",
          "Accept-Language": "en-US,en;q=0.8,fa;q=0.6",
          "Cookie": "SAMANPORTALSID=ds0b4usrs67b1ath5s3emr0mq3; styleirimoir=null",
      }
  };

  // Set up the request
  var post_req = http.request(post_options, function(res) {
      // res.setEncoding('utf8');
      var body="";
      res.on('data', function (chunk) {
        var sub=chunk.toString("utf8");
        // console.log("hell");
          // sub=sub.substring(sub.indexOf('__divReportContainer__')+25);
          // console.log(sub);
          body+=chunk;

      });
      res.on("end",function(){
        body=body.substring(body.indexOf('id="__divReportContainer__">')+29);
        body=body.substring(body.indexOf('<table'));
        body=body.substring(0,body.indexOf('</table>'));
        // var pat=/<td.+?>/g;
        // if(pat.test(body)==true)
        // {
        // console.log(pat.lastIndex);
        // console.log(body.substr(0,pat.lastIndex));
        // }
        body=body.substring(body.indexOf('</tr>')+5);
        body=body.substring(body.indexOf('</tr>')+5);

        var pat=/<td.+?>/g;
        body=body.replace(pat,"");
        pat=/<tr.+?>/g;
        body=body.replace(pat,"");
        pat=/<\/td.+?/g;
        body=body.replace(pat,",");
        pat=/<\/tr.+?/g;
        body=body.replace(pat,"\n");
        saveData(body,stations[relatedStation]+".txt",uri);
        console.log("Done getting data for "+uri+"----"+stations[relatedStation]);
      });
      res.on("error",function(){console.log(chalk.red(prov+" , "+relatedStation+" , "+statType));});
  });

  // post the data
  post_req.write(post_data);
  post_req.end();
  // var form = new form_data();
  // form.append("activeFormName","report_builder_form")
  // form.append("repProviance",prov);
  // form.append("repStation",relatedStation);
  // form.append("parameters",statType);
  // form.append("start_year",1951);
  // form.append("end_year",2014);
  // form.append("SearchBtn","جستجو");
  // form.append("__sisReportRowCount",10);
  // form.append("__sisReportParamType","simple");
//   form.submit("http://irimo.ir/far/wd/2703-%D8%AF%D8%B3%D8%AA%D8%B1%D8%B3%DB%8C-%D8%AF%D8%A7%D8%AF%D9%87-%D9%87%D8%A7%DB%8C-%D8%A7%D9%82%D9%84%DB%8C%D9%85%DB%8C-%D8%AA%D8%A7%D8%B1%DB%8C%D8%AE%DA%86%D9%87.html", function(err, res) {
//   if(res.statusCode==200)
//   {
//     console.log("hell");
//     res.on("data",function(data){
//     var table;
//     table=data.substr(data.indexOf("<tbody>")+7);
//     table=table.substr(table.indexOf("</tbody>")+8);
//     console.log(table);
//     });
//   }
//   else{
//     console.log(chalk.red("sss"))
//   }
//   res.resume();
// });
}
//////////////////////////////////////////////////////////////////////////////////////
function getObjectKeyIndex(obj, keyToFind) {
    var i = 0, key;

    for (key in obj) {
        if (key == keyToFind) {
            return i;
        }

        i++;
    }

    return null;
}
//////////////////////////////////////////////////////////////////////////////////////
function sleep(milliseconds) {
  var start = new Date().getTime();
  for (var i = 0; i < 1e7; i++) {
    if ((new Date().getTime() - start) > milliseconds){
      break;
    }
  }
}
//////////////////////////////////////////////////////////////////////////////////////
function reverse(s) {
  var o = [];
  for (var i = 0, len = s.length; i <= len; i++)
    o.push(s.charAt(len - i));
  return o.join('');
}
